Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateSummary
[Number] Path of Travel lines successfully updated.
[Number] Path of Travel lines failed to update.

Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateFailureSingle
Path of Travel failed to update.

Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateFailureMultiple
[Number] Path of Travel lines failed to update.
[Reason for failure]

Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.ResultAffectedByCrop
A crop region is enabled in the view. The Path of Travel may not be the optimized route because it is calculating only inside the crop region.
Consider uncropping the view and placing another Path of Travel to ensure you see the optimized route.

Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.CannotBePasted
Path of Travel cannot be pasted into this view.

Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures
Failures about PathOfTravel.